# Tap homebrew

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'mas-cli/tap'

# Brew packages

# brew 'node'
# brew 'python'
# brew 'go'
brew 'gnu-sed'
brew 'zsh-autosuggestions' # Another really helpful zsh plugin.
brew 'zsh-syntax-highlighting' # A plugin for zsh to make your command line life much easier.
# brew 'ncdu' # better disk usage visualisation
# brew 'httpie' # Improved CURL command line tool
# brew 'svg2png' # Convert svg to png in the command line
# brew 'siege' # HTTP Concurrency test tool
cask 'font-cascadia-code' # better source code font
cask 'font-fira-code' # better source code font
brew 'ssh-copy-id' # Missing MacOS command to manage ssh keys
# brew 'tmux'
brew 'wget' # Download (get) remote data
brew 'openssl'
brew 'freetype'
brew 'mas' # Mac App Store apps managed by command line
brew 'z' # command line helper
brew 'pkg-config', link: true
brew 'vim' # Vim editor
brew 'curl', link: true
brew 'git'
brew 'make'
# brew 'jq' # jq is a lightweight and flexible command-line JSON processor.
# brew 'xsv' # xsv is for CSV file parsing, and is fast, full featured, and flexible.
brew 'nano'
brew 'bcrypt' # bcrypt is high quality encryption that is very popular
# brew 'kubectl' # Kubernetes command-line tool to run commands against Kubernetes clusters.
# brew 'minikube' # Run a single-node Kubernetes cluster in a virtual machine on your personal computer.
brew 'htop' # Improved process manager
brew 'yadm' # I use this to manage my dotfiles

# Quick Look Improvements
# cask 'apparency' # Quicklook MacApp content
# cask 'betterzip' # Preview ZIP archives
# cask 'provisionql' # Preview iOS / macOS app and provision information
# cask 'quicklookapk' # Preview Android APK files
# cask 'quicklook-pat' # Preview Adobe Photoshop pattern files
# cask 'qlcolorcode' # colored code on quick view
# cask 'qlstephen' # Preview plain text files without or with unknown file extension. Example: README, CHANGELOG, index.styl, etc.
cask 'qlmarkdown' # markdown quick view
cask 'quicklook-json' # JSON quick view
cask 'qlimagesize' # image size for quick view
# cask 'quicklookase' # Preview Adobe ASE Color Swatches
cask 'qlvideo' # Preview most types of video files, as well as their thumbnails, cover art and metadata
# cask 'suspicious-package' # Preview the contents of a standard Apple installer package
cask 'webpquicklook' # Webp quick view


# Cask (GUI) Apps

## browsers
# cask 'brave-browser'
cask 'google-chrome'
# cask 'firefox'
# cask 'firefox-developer-edition'

## General Utilities
cask "miro"
cask '1password'
cask 'cheatsheet' # Cheatsheet manager
# cask 'appcleaner' # AppCleaner thoroughly uninstalls unwanted apps.
cask 'authy' # OTP/multi-factor authentication.(recommended)

## Code Editing
# cask 'visual-studio-code' # Open source Code Editor
cask 'phpstorm' # Jetbraibs PHP IDE

## Development Utilities
cask 'docker' # docker desktop
cask 'ngrok' # HTTP Remote Proxy
cask 'postman' # Full featured HTTP tests
cask 'charles' # Charles: enables a developer to view HTTP traffic.
cask 'sequel-ace' # MySQL Database Manager
cask 'microsoft-remote-desktop' # Remote Desktop.

## Communication
cask 'slack' # Slack chat
cask 'zoom' # online meetings
